#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.vpc.data.aws_availability_zones.az_list: Reading...
module.eks.aws_iam_role.eks_role: Refreshing state... [id=eks-cluster-role]
module.vpc.aws_eip.lb: Refreshing state... [id=eipalloc-00b6f995c40471ac7]
module.vpc.aws_vpc.vpc: Refreshing state... [id=vpc-02ba6a8f897437fde]
module.eks.aws_iam_role.eks_node_role: Refreshing state... [id=eks-node-group-role]
module.eks.data.aws_ami_ids.ubuntu: Reading...
module.eks.aws_iam_role_policy_attachment.eks_ComputePolicy: Refreshing state... [id=eks-cluster-role-20250616084724101400000004]
module.eks.aws_iam_role_policy_attachment.eks_elb_Policy: Refreshing state... [id=eks-cluster-role-20250616084724138100000007]
module.eks.aws_iam_role_policy_attachment.eks_np_Policy: Refreshing state... [id=eks-cluster-role-20250616084724137700000006]
module.eks.aws_iam_role_policy_attachment.eks_ebs_Policy: Refreshing state... [id=eks-cluster-role-20250616084724176100000008]
module.eks.aws_iam_role_policy_attachment.eks_policy: Refreshing state... [id=eks-cluster-role-20250616084724108100000005]
module.eks.aws_iam_role_policy_attachment.node_ecr_ReadOnly: Refreshing state... [id=eks-node-group-role-20250616084724078600000003]
module.eks.aws_iam_role_policy_attachment.eks_worker_policy: Refreshing state... [id=eks-node-group-role-20250616084724020400000001]
module.eks.aws_iam_role_policy_attachment.node_ecr_PullOnly: Refreshing state... [id=eks-node-group-role-20250616084724035200000002]
module.vpc.data.aws_availability_zones.az_list: Read complete after 0s [id=eu-west-1]
module.eks.data.aws_ami_ids.ubuntu: Read complete after 0s [id=3058483546]
module.vpc.aws_subnet.prv2_subnet: Refreshing state... [id=subnet-0b62cbf5f1b1dff9f]
module.vpc.aws_subnet.pub1_subnet: Refreshing state... [id=subnet-06ab72806d072d47a]
module.vpc.aws_subnet.prv1_subnet: Refreshing state... [id=subnet-061902f3da41c820f]
module.vpc.aws_internet_gateway.gw: Refreshing state... [id=igw-03e4df14d61f3a4a9]
module.vpc.aws_subnet.pub2_subnet: Refreshing state... [id=subnet-02f8a0c444dbeb6cb]
module.vpc.aws_subnet.pub3_subnet: Refreshing state... [id=subnet-0133103110cef558f]
module.vpc.aws_subnet.prv3_subnet: Refreshing state... [id=subnet-09638282e66332a4c]
module.eks.aws_security_group.eks_cluster_sg: Refreshing state... [id=sg-0c8a2f5e09175d4f2]
module.vpc.aws_route_table.nat_routes: Refreshing state... [id=rtb-06aa6f399a9bf1025]
module.vpc.aws_route_table.pub_routes: Refreshing state... [id=rtb-0124dc5ad20e2174e]
module.vpc.aws_nat_gateway.nat: Refreshing state... [id=nat-05db3c67cd07d7fff]
module.eks.aws_security_group.eks_node_sg: Refreshing state... [id=sg-029fa5efb24b24ce2]
module.eks.aws_eks_cluster.eks: Refreshing state... [id=eks-sharks-cluster]
module.vpc.aws_route_table_association.pub3_subnet_route: Refreshing state... [id=rtbassoc-0703335d275137317]
module.vpc.aws_route_table_association.pub2_subnet_route: Refreshing state... [id=rtbassoc-03dac877a3b3bf869]
module.vpc.aws_route_table_association.pub1_subnet_route: Refreshing state... [id=rtbassoc-0e848946a7ef3bbce]
module.vpc.aws_route_table.prv_routes: Refreshing state... [id=rtb-0035d1174e8783c54]
module.eks.aws_launch_template.ubuntu_lt: Refreshing state... [id=lt-0f6f651da97ba6438]
module.vpc.aws_route_table_association.prv2_subnet_route: Refreshing state... [id=rtbassoc-0c64b244bb5a358f1]
module.vpc.aws_route_table_association.prv3_subnet_route: Refreshing state... [id=rtbassoc-0d8610936658c86da]
module.vpc.aws_route_table_association.prv1_subnet_route: Refreshing state... [id=rtbassoc-03147e001129e0042]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.eks.aws_eks_node_group.eks_nodes will be created
  + resource "aws_eks_node_group" "eks_nodes" {
      + ami_type               = "CUSTOM"
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "eks-sharks-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = (known after apply)
      + node_group_name        = (known after apply)
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::975049996360:role/eks-node-group-role"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-02f8a0c444dbeb6cb",
          + "subnet-061902f3da41c820f",
          + "subnet-06ab72806d072d47a",
          + "subnet-0b62cbf5f1b1dff9f",
        ]
      + tags                   = {
          + "environment" = "prod"
        }
      + tags_all               = {
          + "environment" = "prod"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = "lt-0f6f651da97ba6438"
          + name    = (known after apply)
          + version = "$Latest"
        }

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 3
          + min_size     = 2
        }

      + update_config (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Adebisea, Action: `pull_request`, Working Directory: ``, Workflow: `Infra Setup CI/CD Pipeline`*